{"id":"1","name":"Seven Learning Goals of the Baccalaureate","description":"All bachelor's degree requirements are rooted in WSU’s Seven Learning Goals and Outcomes, which identify core skills and knowledge that students should develop through their undergraduate studies.  Courses in the UCORE curriculum engage students in meeting these goals.","author":"384","last_modified":"2016-07-27 17:25:05","data":[["Seven Learning Goals","Outcomes - Examples"],["<strong>CRITICAL and CREATIVE THINKING<\/strong>\nGraduates will use reason, evidence, and context to increase knowledge, to reason ethically, and to innovate in imaginative ways.","<p class=\"nrml\">Graduates may demonstrate critical and creative thinking by their ability to:<\/p><ol><li>Define, analyze, and solve problems.<\/li><li>Integrate and synthesize knowledge from multiple sources.<\/li><li>Assess the accuracy and validity of findings and conclusions.<\/li><li>Understand how one thinks, reasons, and makes value judgments, including ethical and aesthetical judgments.<\/li><li>Understand diverse viewpoints, including different philosophical and cultural perspectives.<\/li><li>Combine and synthesize existing ideas, images, or expertise in original ways.<\/li><li>Think, react, and work in an imaginative way characterized by a high degree of innovation, divergent thinking, and risk taking.<\/li><\/ol>"],["<strong>QUANTITATIVE REASONING<\/strong>\nGraduates will solve quantitative problems from a wide variety of authentic contexts and everyday life situations.","<p class=\"nrml\">Graduates may demonstrate quantitative and symbolic reasoning by their ability to:<\/p><ul><li>Explain information presented in mathematical forms (e.g., equations, graphs, diagrams, tables, and words).<\/li><li>Convert relevant information into various mathematical forms (e.g., equations, graphs, diagrams, tables, and words).<\/li><li>Understand and apply quantitative principles and methods in the solution of problems.<\/li><li>Make judgments and draw appropriate conclusions based on the quantitative analysis of data, while recognizing the limits of this analysis.<\/li><li>Identify and evaluate important assumptions in estimation, modeling, and data analysis.<\/li><li>Express quantitative evidence in support of the argument or purpose of work (in terms of what evidence is used and how it is formatted, presented, and contextualized).<\/li><\/ul>"],["<strong>SCIENTIFIC LITERACY<\/strong>\nGraduates will have a basic understanding of major scientific concepts and processes required for personal decision-making, participation in civic affairs, economic productivity and global stewardship.","<p class=\"nrml\">Graduates may demonstrate scientific literacy by their ability to:<\/p><ul>\t<li>Identify scientific issues underlying global, national, local and personal decisions and communicate positions that are scientifically and technologically informed.<\/li><li>Evaluate the quality of scientific and health-related information on the basis of its source and the methods used to generate it.<\/li><li>Pose and evaluate arguments based on evidence and apply conclusions from such arguments appropriately.<\/li><li>Recognize the societal benefits and risks associated with scientific and technological advances.<\/li><\/ul>"],["<strong>INFORMATION LITERACY<\/strong>\nGraduates will effectively identify, locate, evaluate, use responsibly and share information for the problem at hand.","<p class=\"nrml\">Graduates may demonstrate information literacy by their ability to:<\/p><ul>\t<li>Determine the extent and type of information needed.<\/li><li>Implement well-designed search strategies.<\/li><li>Access information effectively and efficiently from multiple sources.<\/li><li>Assess credibility and applicability of information sources.<\/li><li>Use information to accomplish a specific purpose.<\/li><li>Access and use information ethically and legally.<\/li><\/ul>"],["<strong>COMMUNICATION<\/strong>\nGraduates will write, speak and listen to achieve intended meaning and understanding among all participants.","<p class=\"nrml\">Graduates may demonstrate communication skills by the ability to:<\/p><ul>\t<li>Recognize how circumstances, background, values, interests and needs shape communication sent and received.<\/li>\t<li>Tailor message to the audience.<\/li><li>Express concepts, propositions, and beliefs in coherent, concise and technically correct form.<\/li><li>Choose appropriate communication medium and technology.<\/li><li>Speak with comfort in front of groups.<\/li><li>Follow social norms for individual and small group interactions, which includes listening actively.<\/li><\/ul>"],["<strong>DIVERSITY<\/strong>\nGraduates will understand, respect and interact constructively with others of similar and diverse cultures, values, and perspectives.","<p class=\"nrml\">With regard to local and global diversity, graduates may demonstrate their ability to:<\/p><ul><li>Critically assess their own core values, cultural assumptions and biases in relation to those held by other individuals, cultures, and societies.<\/li><li>Analyze and critique social, economic and political inequality on regional, national and global levels, including identifying one's own position within systems.<\/li><li>Recognize how events and patterns in the present and past structure and affect human societies and world ecologies.<\/li><li>Critically assess the cultural and social underpinnings of knowledge claims about individuals and groups, and their relations to one another.<\/li><li>Actively seek opportunities to learn from diverse perspectives and to combat inequalities.<\/li><\/ul>"],["<strong>DEPTH, BREADTH, AND INTEGRATION OF LEARNING<\/strong>\nGraduates will develop depth, breadth, and integration of learning for the benefit of themselves, their communities, their employers, and for society at large.","<p class=\"nrml\">Graduates may demonstrate depth, breadth, and integration of learning:<\/p><ul>\t<li>Through study in the sciences and mathematics, social sciences, humanities, histories, languages, and the arts.<\/li><li>By showing a depth of knowledge within the chosen academic field of study based on integration of its history, core methods, techniques, vocabulary, and unsolved problems.<\/li><li>By applying the concepts of the general and specialized studies to personal, academic, service learning, professional, and\/or community activities.<\/li><li>By understanding how the methods and concepts of the chosen discipline relate to those of other disciplines and by possessing the ability to engage in cross-disciplinary activities.<\/li><\/ul>"]],"options":{"last_editor":384,"table_head":true,"table_foot":false,"alternating_row_colors":true,"row_hover":true,"print_name":false,"print_name_position":"above","print_description":false,"print_description_position":"below","extra_css_classes":"learning-goals","use_datatables":true,"datatables_sort":false,"datatables_filter":true,"datatables_paginate":false,"datatables_lengthchange":true,"datatables_paginate_entries":10,"datatables_info":false,"datatables_scrollx":false,"datatables_custom_commands":""},"visibility":{"rows":[1,1,1,1,1,1,1,1],"columns":[1,1]}}